       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA_MUNDO_2.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 HOLA-MUNDO PIC X(10) VALUE "Hola mundo".
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY HOLA-MUNDO
            STOP RUN.
       END PROGRAM HOLA_MUNDO_2.
