       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA_MUNDO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hola mundo"
            STOP RUN.
       END PROGRAM HOLA_MUNDO.
